# Biblioteka Pandas

## 1. Wstęp

Pandas to zewnętrzna biblioteka używana do analizy, przetwarzania i obrazowania dużych zbiorów danych np. zaimportowanych z zewnętrznych źródeł. 

Abo skorzystać z możliwości tej biblioteki należy ją zaimportować do swojego programu:

In [1]:
import pandas

print(pandas.__version__)

2.3.0

Podczas improtowania bibliotek można skorzystać z tworzenia aliasów (innych nazw) - cel: wygoda, tylko i wyłącznie :)

In [2]:
import pandas as pd
# od teraz można używać nazwy pd zamiast pandas...

print(pd.__version__)

2.3.0

### 1.1. Serie
Serier są tablicami jednowymiarowymi (kolumna), które można utworzyć z innych typów uporządkowanych pythona (listy i krotki)

In [3]:
import pandas as pd

lista = ["jeden",2,3.5,True,'2022-03-19']
krotka = (1,3,5,3,5)

seria = pd.Series(lista)
#seria = pd.Series(krotka)

print(seria)

0         jeden
1             2
2           3.5
3          True
4    2022-03-19
dtype: object

### 1.2. Etykiety serii
Serie biblioteki pandas umożliwiają dodawanie etykiet, dzięki którym możliwe jest odowływanie się do elementów:

In [4]:
import pandas as pd

dm = [31,28,31,30,31,30,31,31,30,31,30,31]
print("-------------- Lista ---------------\n")
print(dm)

data = pd.Series(dm) 
print("\n-------- Seria (pandas) ------------\n")
print(data)
print("\nElement o indeksie 0: ", data[0])

etykiety_pl = ["styczen","luty","marzec","kwiecien","maj","czerwiec",
          "lipiec","sierpien","wrzesien","pazdziernik","listopad","grudzien"]

dataWithLabel = pd.Series(dm,index = etykiety_pl)

print("\n------ Seria z etykietami ----------\n")
print(dataWithLabel)

print("\nElement o indeksie \"styczen\": ", dataWithLabel["styczen"])

-------------- Lista ---------------

[31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]

-------- Seria (pandas) ------------

0     31
1     28
2     31
3     30
4     31
5     30
6     31
7     31
8     30
9     31
10    30
11    31
dtype: int64

Element o indeksie 0:  31

------ Seria z etykietami ----------

styczen        31
luty           28
marzec         31
kwiecien       30
maj            31
czerwiec       30
lipiec         31
sierpien       31
wrzesien       30
pazdziernik    31
listopad       30
grudzien       31
dtype: int64

Element o indeksie "styczen":  31

### 1.3. Słownik jako seria.
Słownik jest typem nieuporządkownym, ale z uwagi na skojarzenie klucza z wartością możliwe jest przekonwertowanie go na serię biblioteki pandas. Możliwe jest również konwersja tylko wybranych elementów słownika na serię:

In [ ]:
import pandas as pd
slownik = {"Styczen": 31, "Luty": 28, "Marzec": 31}

dataWithLabel = pd.Series(slownik)

print("\n------ Seria ze słownika ----------\n")
print(dataWithLabel)

dataWithLabel = pd.Series(slownik, index = ["Styczen","Marzec"])
print("\n--- Seria ze słownika (wybrane) ---\n")
print(dataWithLabel)

------ Seria ze słownika ----------

Styczen    31
Luty       28
Marzec     31
dtype: int64

--- Seria ze słownika (wybrane) ---

Styczen    31
Marzec     31
dtype: int64

### 1.4. DataFrame - tablice dwuwymiarowe

DataFrame to drugi obiekt typu tablicowego ale w przeciwieństwie do serii jest dwuwymiarowy (kolumny i wiersze).

Poniższy przykład przedstawia konwersję złożonych danych na DataFrame:

In [ ]:
import pandas as pd

data = {
    "polish": ["styczen","luty","marzec","kwiecien","maj","czerwiec",
                "lipiec","sierpien","wrzesien","pazdziernik","listopad","grudzien"],
    "days" :  [31,28,31,30,31,30,31,31,30,31,30,31]   
}

dataFrame = pd.DataFrame(data)

print(dataFrame)

         polish  days
0       styczen    31
1          luty    28
2        marzec    31
3      kwiecien    30
4           maj    31
5      czerwiec    30
6        lipiec    31
7      sierpien    31
8      wrzesien    30
9   pazdziernik    31
10     listopad    30
11     grudzien    31

### 1.5. Podzbiory danych
W celu wyświetlenia części danych można skorzystać z metod:
- `head(n)` - zwraca `n` pierwszysch wierszy DataFrame (domyślnie 5)
- `tail(n)` - zwraca `n` pierwszysch wierszy DataFrame
- `loc[]` - zwraca wybrane wiersze i kolumny według poniższego schematu:

  Składnia: `loc[start_row : stop_row , start_col : stop_col]`

In [ ]:
import pandas as pd

data = {
    "polish": ["styczen","luty","marzec","kwiecien","maj","czerwiec",
                "lipiec","sierpien","wrzesien","pazdziernik","listopad","grudzien"],
    "days" :  [31,28,31,30,31,30,31,31,30,31,30,31]   
}

dataFrame = pd.DataFrame(data)

print("Początkowe i końcowe elementy DataFrame:\n")
print(dataFrame.head())
print("------------------------------\n")
print(dataFrame.tail(4))
print("------------------------------\n")

print("Wiersz o indeksie 2:\n")
print(dataFrame.loc[2]) #To samo co loc[2,:]
print("------------------------------\n")
print("Wiersze o indeksie 2 i 4:\n")
print(dataFrame.loc[[2, 4]])
print("------------------------------\n")
print("Trzy pierwsze wiersze, kolumna 'polish' - bez nagłówka!\n")
print(dataFrame.loc[:3,'polish'])
print("------------------------------\n")
print("Trzy pierwsze wiersze, kolumna 'polish' - z nagłówkiem!\n")
print(dataFrame.loc[:3,['polish']])

Początkowe i końcowe elementy DataFrame:

     polish  days
0   styczen    31
1      luty    28
2    marzec    31
3  kwiecien    30
4       maj    31
------------------------------

         polish  days
8      wrzesien    30
9   pazdziernik    31
10     listopad    30
11     grudzien    31
------------------------------

Wiersz o indeksie 2:

polish    marzec
days          31
Name: 2, dtype: object
------------------------------

Wiersze o indeksie 2 i 4:

   polish  days
2  marzec    31
4     maj    31
------------------------------

Trzy pierwsze wiersze, kolumna 'polish' - bez nagłówka!

0     styczen
1        luty
2      marzec
3    kwiecien
Name: polish, dtype: object
------------------------------

Trzy pierwsze wiersze, kolumna 'polish' - z nagłówkiem!

     polish
0   styczen
1      luty
2    marzec
3  kwiecien

### 1.6. Indeksy wierszy
Podobnie jak w seriach, w DataFrame możlwe jest dodanie własnych indeksów (nazw wierszy):

In [ ]:
import pandas as pd

data = {
    "polish": ["styczen","luty","marzec","kwiecien"],
    "days" :  [31,28,31,30]   
}

dataFrameWithIndex = pd.DataFrame(data, index = ["Jan","Feb","Mar","Apr"])

print(dataFrameWithIndex)

#Korzystanie z atrybutu loc:

print("------------------------------\n")
print(dataFrameWithIndex.loc["Apr"])

print("------------------------------\n")
print(dataFrameWithIndex.loc[["Apr","Jan"]])

print("------------------------------\n")
print(dataFrameWithIndex.loc[["Apr","Jan"],["polish"]])

       polish  days
Jan   styczen    31
Feb      luty    28
Mar    marzec    31
Apr  kwiecien    30
------------------------------

polish    kwiecien
days            30
Name: Apr, dtype: object
------------------------------

       polish  days
Apr  kwiecien    30
Jan   styczen    31
------------------------------

       polish
Apr  kwiecien
Jan   styczen

### 1.7. Import danych z pliku

W przypadku dużej ilości danych wygodne jest importowanie ich z zewnętrznego źródł np. pliku csv, xlsx, json itp.

Podczas importowania należy zwrócić uwagę na sposób umieszczania danych (np. separator pliu CSV) oraz kodowanie pliku źródłowego (np. UTF-8)

In [5]:
import pandas as pd

dane = pd.read_csv("DanePogodowe2021.csv",sep=";",encoding="UTF-8",decimal=",")
#dane = pd.read_excel("DanePogodowe2021.xlsx")

print(dane)

      Rok  Miesiąc  Dzień Temperatura Wiatr
0    2021        1      1        -2.8   5.7
1    2021        1      2        -1.9   8.0
2    2021        1      3         -.5   8.0
3    2021        1      4          .3   8.0
4    2021        1      5         -.2   8.0
..    ...      ...    ...         ...   ...
360  2021       12     27        -9.6   1.7
361  2021       12     28        -2.7   6.0
362  2021       12     29         2.9   8.0
363  2021       12     30         6.3   7.7
364  2021       12     31        10.5   7.0

[365 rows x 5 columns]

### 2. Funkcje (metody) DataFrame

Dokumentacja: https://pandas.pydata.org/pandas-docs/stable/reference/frame.html

- Sortowanie - porządkowanie danych po indeksach `sort_index(ascending=False|True)` lub wartościach `sort_values(by="Klucz",ascending=True)`. Sortowanie może być rosnące albo malejące.
- Suma - suma `sum()`wszystkich wartości dla danego klucza
- Min/Max - najmniejsza `min()` i największa `max()` wartość w zbiorze
- Średnia - średnia arytmetyczna `mean()`, pomija wartości puste `mean(skipna=True)`
- Odchylenie standardowe `std()` (pierwiastek kwadratowy z wariancji, wariancja to z kolei średnia kwadratów różnic wartości od średniej)
- Mediana `median()` - wartość środkowa uporządkowanego zbioru
- Dominata `mode()` - wartość przeważająca (najczęściej występująca)

In [ ]:
import pandas as pd

oceny = { 'Fizyka': [68.3, 84, 77, 78],
          'Matematyka': [34, 46, 93, 59],
          'Chemia': [34, 45, 45, 84]}

dane = pd.DataFrame(oceny)

print(dane)
print("\nSumy:")
print(dane.sum())

print("\nMax:")
print(dane.max())

print("\nMin:")
print(dane.min())

print("\nŚrednie:")
print(dane.mean())

print("\nMediana:")
print(dane.median())

print("\nDominata:")
print(dane.mode())

print("\nOdchylenie standardowe:")
print(dane.std())

print("\nPosortowane po fizyce:")
print(dane.sort_values(by="Fizyka", ascending=False))

print("\nPosortowane po indeksach:")
print(dane.sort_index(ascending=False))

print("\nInfo o danych:")
print(dane.info())

print("\nOpis danych:")
print(dane.describe())

   Fizyka  Matematyka  Chemia
0    68.3          34      34
1    84.0          46      45
2    77.0          93      45
3    78.0          59      84

Sumy:
Fizyka        307.3
Matematyka    232.0
Chemia        208.0
dtype: float64

Max:
Fizyka        84.0
Matematyka    93.0
Chemia        84.0
dtype: float64

Min:
Fizyka        68.3
Matematyka    34.0
Chemia        34.0
dtype: float64

Średnie:
Fizyka        76.825
Matematyka    58.000
Chemia        52.000
dtype: float64

Mediana:
Fizyka        77.5
Matematyka    52.5
Chemia        45.0
dtype: float64

Dominata:
   Fizyka  Matematyka  Chemia
0    68.3          34    45.0
1    77.0          46     NaN
2    78.0          59     NaN
3    84.0          93     NaN

Odchylenie standardowe:
Fizyka         6.469608
Matematyka    25.468935
Chemia        21.954498
dtype: float64

Posortowane po fizyce:
   Fizyka  Matematyka  Chemia
1    84.0          46      45
3    78.0          59      84
2    77.0          93      45
0    68.3          34      34

Posortowane po indeksach:
   Fizyka  Matematyka  Chemia
3    78.0          59      84
2    77.0          93      45
1    84.0          46      45
0    68.3          34      34

Info o danych:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Fizyka      4 non-null      float64
 1   Matematyka  4 non-null      int64
 2   Chemia      4 non-null      int64
dtypes: float64(1), int64(2)
memory usage: 228.0 bytes
None

Opis danych:
          Fizyka  Matematyka     Chemia
count   4.000000    4.000000   4.000000
mean   76.825000   58.000000  52.000000
std     6.469608   25.468935  21.954498
min    68.300000   34.000000  34.000000
25%    74.825000   43.000000  42.250000
50%    77.500000   52.500000  45.000000
75%    79.500000   67.500000  54.750000
max    84.000000   93.000000  84.000000

### 2.2. Eksport danych DataFrame

Biblioteka pandas umożliwia eksport danych z DataFrame np. do pliku HTML.

In [11]:
html = dane.to_html()
print(html)
text_file = open("export.html", "w")
text_file.write(html)
text_file.close()

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Fizyka</th>
      <th>Matematyka</th>
      <th>Chemia</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>68.3</td>
      <td>34</td>
      <td>34</td>
    </tr>
    <tr>
      <th>1</th>
      <td>84.0</td>
      <td>46</td>
      <td>45</td>
    </tr>
    <tr>
      <th>2</th>
      <td>77.0</td>
      <td>93</td>
      <td>45</td>
    </tr>
    <tr>
      <th>3</th>
      <td>78.0</td>
      <td>59</td>
      <td>84</td>
    </tr>
  </tbody>
</table>

### 2.3. Usuwanie duplikatów

In [34]:
lista = [1,2,3,4,5,6,7,5,4,5,6,7,5,43,4,5]
df = pd.DataFrame(lista)

print(df.duplicated())
print(df.drop_duplicates())

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7      True
8      True
9      True
10     True
11     True
12     True
13    False
14     True
15     True
dtype: bool
     0
0    1
1    2
2    3
3    4
4    5
5    6
6    7
13  43

### 2.4. Korelacja pomiędzy danymi

In [ ]:
dane = {'Temp1':[1,2,3,4,3,2,1,2,3],
        'Temp2':[3,4,5,5,4,3,2,2,1],
        'Temp3':[2,4,6,9,5,4,2,4,7],}
        
df = pd.DataFrame(dane)

print(df)

df.corr()

   Temp1  Temp2  Temp3
0      1      3      2
1      2      4      4
2      3      5      6
3      4      5      9
4      3      4      5
5      2      3      4
6      1      2      2
7      2      2      4
8      3      1      7

          Temp1     Temp2     Temp3
Temp1  1.000000  0.478091  0.968936
Temp2  0.478091  1.000000  0.371466
Temp3  0.968936  0.371466  1.000000

### 3. Złączenia tabel

W analizie danych często pracujemy z wieloma zestawami informacji, które musimy połączyć w jeden spójny zbiór. Biblioteka pandas w Pythonie oferuje potężne narzędzia do łączenia tabel (DataFrame'ów) – podobnie jak robimy to w relacyjnych bazach danych za pomocą SQL. Dzięki funkcji merge() możemy łączyć dane według wspólnych kolumn lub indeksów, wybierając rodzaj złączenia: inner, outer, left lub right. Pozwala to łatwo integrować dane z różnych źródeł i przygotować je do dalszej analizy.

In [ ]:
import pandas as pd

countries = pd.read_csv(r"państwa.csv",sep=";",decimal=",",encoding="utf-8")
cities = pd.read_csv(r"miasta.csv",sep=";",decimal=",",encoding="utf-8")
weather = pd.read_csv(r"pogoda.csv",sep=";",decimal=",",encoding="utf-8")

### 3.1 Złączenie lewostronne
Wszystkie elementy z tablicy (DF) po lewej stronie znajdą się w wyniku, uzupełnione o dane z prawej tabeli. Jeżeli w prawej tabeli dane nie zostaną odnalezione, zostanie wstawiony NaN

In [28]:
left = pd.merge(countries,cities,how="left",on="Miasto")
print(left)
print("\n")
left.info()

                         Państwo          Miasto  Szerokość     Długość
0                            USA        New York  40.712800  -74.006000
1                            USA     Los Angeles  34.052200 -118.243700
2                            USA         Chicago  41.878100  -87.629800
3                         Kanada         Toronto  43.651070  -79.347015
4                         Kanada       Vancouver  49.282729 -123.120738
5                         Kanada        Montreal        NaN         NaN
6                Wielka Brytania          Londyn  51.507400   -0.127800
7                Wielka Brytania      Manchester  53.480800   -2.242600
8                         Niemcy          Berlin  52.520000   13.405000
9                         Niemcy       Monachium  48.135100   11.582000
10                        Niemcy       Frankfurt        NaN         NaN
11                       Francja           Paryż        NaN         NaN
12                       Francja            Lyon  45.764000    4.835700
13                     Australia          Sydney -33.868800  151.209300
14                     Australia       Melbourne -37.813600  144.963100
15                     Australia        Brisbane -27.469800  153.025100
16                       Japonia           Tokio  35.689500  139.691700
17                       Japonia           Osaka        NaN         NaN
18                       Japonia          Nagoya  35.181500  136.906600
19                      Brazylia       Sao Paulo -23.550500  -46.633300
20                      Brazylia  Rio de Janeiro -22.906800  -43.172900
21                      Brazylia        Brasilia -15.826700  -47.921800
22                         Indie          Mumbai  19.076000   72.877700
23                         Indie           Delhi  28.704100   77.102500
24                         Indie       Bangalore        NaN         NaN
25  Republika Południowej Afryki    Johannesburg -26.204100   28.047300
26  Republika Południowej Afryki       Cape Town -33.924900   18.424100
27  Republika Południowej Afryki          Durban -29.858700   31.021800


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Państwo    28 non-null     object
 1   Miasto     28 non-null     object
 2   Szerokość  23 non-null     float64
 3   Długość    23 non-null     float64
dtypes: float64(2), object(2)
memory usage: 1.0+ KB

### 3.2 Złączenie prawostronne
Wszystkie elementy z tablicy (DF) po prawej stronie znajdą się w wyniku, uzupełnione o dane z lewej tabeli. Jeżeli w lewej tabeli dane nie zostaną odnalezione, zostanie wstawiony NaN

In [29]:
right = pd.merge(countries,cities,how="right",on="Miasto")
print(right)
print("\n")
right.info()

                         Państwo          Miasto  Szerokość     Długość
0                            USA        New York  40.712800  -74.006000
1                            USA     Los Angeles  34.052200 -118.243700
2                            USA         Chicago  41.878100  -87.629800
3                         Kanada         Toronto  43.651070  -79.347015
4                         Kanada       Vancouver  49.282729 -123.120738
5                Wielka Brytania          Londyn  51.507400   -0.127800
6                Wielka Brytania      Manchester  53.480800   -2.242600
7                            NaN      Birmingham  52.486200   -1.890400
8                         Niemcy          Berlin  52.520000   13.405000
9                         Niemcy       Monachium  48.135100   11.582000
10                           NaN        Marsylia  43.296500    5.369800
11                       Francja            Lyon  45.764000    4.835700
12                     Australia          Sydney -33.868800  151.209300
13                     Australia       Melbourne -37.813600  144.963100
14                     Australia        Brisbane -27.469800  153.025100
15                       Japonia           Tokio  35.689500  139.691700
16                       Japonia          Nagoya  35.181500  136.906600
17                      Brazylia       Sao Paulo -23.550500  -46.633300
18                      Brazylia  Rio de Janeiro -22.906800  -43.172900
19                      Brazylia        Brasilia -15.826700  -47.921800
20                         Indie          Mumbai  19.076000   72.877700
21                         Indie           Delhi  28.704100   77.102500
22  Republika Południowej Afryki    Johannesburg -26.204100   28.047300
23  Republika Południowej Afryki       Cape Town -33.924900   18.424100
24  Republika Południowej Afryki          Durban -29.858700   31.021800


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Państwo    23 non-null     object
 1   Miasto     25 non-null     object
 2   Szerokość  25 non-null     float64
 3   Długość    25 non-null     float64
dtypes: float64(2), object(2)
memory usage: 932.0+ bytes

### 3.3 Złączenie wewnętrzne
Tylko elementy znajdujące się w  tablicach (DF) po lewej i po prawej stronie znajdą się w wyniku.

In [30]:
inner = pd.merge(countries,cities,how="inner",on="Miasto")
print(inner)
print("\n")
inner.info()

                         Państwo          Miasto  Szerokość     Długość
0                            USA        New York  40.712800  -74.006000
1                            USA     Los Angeles  34.052200 -118.243700
2                            USA         Chicago  41.878100  -87.629800
3                         Kanada         Toronto  43.651070  -79.347015
4                         Kanada       Vancouver  49.282729 -123.120738
5                Wielka Brytania          Londyn  51.507400   -0.127800
6                Wielka Brytania      Manchester  53.480800   -2.242600
7                         Niemcy          Berlin  52.520000   13.405000
8                         Niemcy       Monachium  48.135100   11.582000
9                        Francja            Lyon  45.764000    4.835700
10                     Australia          Sydney -33.868800  151.209300
11                     Australia       Melbourne -37.813600  144.963100
12                     Australia        Brisbane -27.469800  153.025100
13                       Japonia           Tokio  35.689500  139.691700
14                       Japonia          Nagoya  35.181500  136.906600
15                      Brazylia       Sao Paulo -23.550500  -46.633300
16                      Brazylia  Rio de Janeiro -22.906800  -43.172900
17                      Brazylia        Brasilia -15.826700  -47.921800
18                         Indie          Mumbai  19.076000   72.877700
19                         Indie           Delhi  28.704100   77.102500
20  Republika Południowej Afryki    Johannesburg -26.204100   28.047300
21  Republika Południowej Afryki       Cape Town -33.924900   18.424100
22  Republika Południowej Afryki          Durban -29.858700   31.021800


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Państwo    23 non-null     object
 1   Miasto     23 non-null     object
 2   Szerokość  23 non-null     float64
 3   Długość    23 non-null     float64
dtypes: float64(2), object(2)
memory usage: 868.0+ bytes

### 4 Filtrowanie danych

### 4.1. Wykrywanie i usuwanie wartości NaN

In [40]:
import pandas as pd

countries = pd.read_csv(r"państwa.csv",sep=";",decimal=",",encoding="utf-8")
cities = pd.read_csv(r"miasta.csv",sep=";",decimal=",",encoding="utf-8")
weather = pd.read_csv(r"pogoda.csv",sep=";",decimal=",",encoding="utf-8")

cc = pd.merge(countries,cities,how="left",on="Miasto")

all = pd.merge(inner,weather,how="left",on="Miasto")
# print(all)

Poniższy przykład prezentuje bardzo uproszczony sposób na radzenie sobie z wartościami nieistniejącymi:
- usuwanie rekordów zawierających puste dane
- wypełnianie komórek z pustymi danymi wartościami

In [44]:
kopia1 = all.dropna()
#all.dropna(inplace=True)

kopia1

,Państwo,Miasto,Szerokość,Długość,Temperatura,Opad
1,USA,Los Angeles,34.05220,-118.243700,38.3,2.3
2,USA,Chicago,41.87810,-87.629800,1.0,24.6
3,Kanada,Toronto,43.65107,-79.347015,0.2,144.7
5,Wielka Brytania,Londyn,51.50740,-0.127800,23.1,105.1
6,Wielka Brytania,Manchester,53.48080,-2.242600,31.6,75.3
7,Niemcy,Berlin,52.52000,13.405000,8.5,46.1
8,Niemcy,Monachium,48.13510,11.582000,7.2,96.7
9,Francja,Lyon,45.76400,4.835700,13.7,81.2
10,Australia,Sydney,-33.86880,151.209300,25.6,162.9
12,Australia,Brisbane,-27.46980,153.025100,27.1,107.8
13,Japonia,Tokio,35.68950,139.691700,16.2,59.1
14,Japonia,Nagoya,35.18150,136.906600,17.3,69.7
15,Brazylia,Sao Paulo,-23.55050,-46.633300,28.4,143.6
16,Brazylia,Rio de Janeiro,-22.90680,-43.172900,30.1,7.7
17,Brazylia,Brasilia,-15.82670,-47.921800,26.7,5.3
18,Indie,Mumbai,19.07600,72.877700,29.0,128.0
20,Republika Południowej Afryki,Johannesburg,-26.20410,28.047300,10.4,151.5
22,Republika Południowej Afryki,Durban,-29.85870,31.021800,-0.2,182.7

In [43]:
kopia2 = all.fillna(123)
kopia2

,Państwo,Miasto,Szerokość,Długość,Temperatura,Opad
0,USA,New York,40.712800,-74.006000,123.0,123.0
1,USA,Los Angeles,34.052200,-118.243700,38.3,2.3
2,USA,Chicago,41.878100,-87.629800,1.0,24.6
3,Kanada,Toronto,43.651070,-79.347015,0.2,144.7
4,Kanada,Vancouver,49.282729,-123.120738,123.0,123.0
5,Wielka Brytania,Londyn,51.507400,-0.127800,23.1,105.1
6,Wielka Brytania,Manchester,53.480800,-2.242600,31.6,75.3
7,Niemcy,Berlin,52.520000,13.405000,8.5,46.1
8,Niemcy,Monachium,48.135100,11.582000,7.2,96.7
9,Francja,Lyon,45.764000,4.835700,13.7,81.2
10,Australia,Sydney,-33.868800,151.209300,25.6,162.9
11,Australia,Melbourne,-37.813600,144.963100,123.0,123.0
12,Australia,Brisbane,-27.469800,153.025100,27.1,107.8
13,Japonia,Tokio,35.689500,139.691700,16.2,59.1
14,Japonia,Nagoya,35.181500,136.906600,17.3,69.7
15,Brazylia,Sao Paulo,-23.550500,-46.633300,28.4,143.6
16,Brazylia,Rio de Janeiro,-22.906800,-43.172900,30.1,7.7
17,Brazylia,Brasilia,-15.826700,-47.921800,26.7,5.3
18,Indie,Mumbai,19.076000,72.877700,29.0,128.0
19,Indie,Delhi,28.704100,77.102500,123.0,123.0
20,Republika Południowej Afryki,Johannesburg,-26.204100,28.047300,10.4,151.5
21,Republika Południowej Afryki,Cape Town,-33.924900,18.424100,123.0,123.0
22,Republika Południowej Afryki,Durban,-29.858700,31.021800,-0.2,182.7

### 4.2 Filtrowanie po kolumnach

In [41]:
all["Państwo"]           # jedna kolumna
all[["Państwo", "Miasto"]]  # kilka kolumn

                         Państwo          Miasto
0                            USA        New York
1                            USA     Los Angeles
2                            USA         Chicago
3                         Kanada         Toronto
4                         Kanada       Vancouver
5                Wielka Brytania          Londyn
6                Wielka Brytania      Manchester
7                         Niemcy          Berlin
8                         Niemcy       Monachium
9                        Francja            Lyon
10                     Australia          Sydney
11                     Australia       Melbourne
12                     Australia        Brisbane
13                       Japonia           Tokio
14                       Japonia          Nagoya
15                      Brazylia       Sao Paulo
16                      Brazylia  Rio de Janeiro
17                      Brazylia        Brasilia
18                         Indie          Mumbai
19                         Indie           Delhi
20  Republika Południowej Afryki    Johannesburg
21  Republika Południowej Afryki       Cape Town
22  Republika Południowej Afryki          Durban

### 4.3 Wybór wierszy po indeksie (iloc/loc)

In [47]:
print(all.iloc[0])              # pierwszy wiersz
print("------------------------------\n")
print(all.iloc[0:5])            # wiersze od 0 do 4
print("------------------------------\n")
print(all.loc[3])               # wiersz o indeksie 3

Państwo             USA
Miasto         New York
Szerokość       40.7128
Długość         -74.006
Temperatura         NaN
Opad                NaN
Name: 0, dtype: object
------------------------------

  Państwo       Miasto  Szerokość     Długość  Temperatura   Opad
0     USA     New York  40.712800  -74.006000          NaN    NaN
1     USA  Los Angeles  34.052200 -118.243700         38.3    2.3
2     USA      Chicago  41.878100  -87.629800          1.0   24.6
3  Kanada      Toronto  43.651070  -79.347015          0.2  144.7
4  Kanada    Vancouver  49.282729 -123.120738          NaN    NaN
------------------------------

Państwo           Kanada
Miasto           Toronto
Szerokość       43.65107
Długość       -79.347015
Temperatura          0.2
Opad               144.7
Name: 3, dtype: object

### 4.4. Warunki logiczne

In [ ]:
all[all["Temperatura"] > 20]

            Państwo          Miasto  Szerokość   Długość  Temperatura   Opad
1               USA     Los Angeles    34.0522 -118.2437         38.3    2.3
5   Wielka Brytania          Londyn    51.5074   -0.1278         23.1  105.1
6   Wielka Brytania      Manchester    53.4808   -2.2426         31.6   75.3
10        Australia          Sydney   -33.8688  151.2093         25.6  162.9
12        Australia        Brisbane   -27.4698  153.0251         27.1  107.8
15         Brazylia       Sao Paulo   -23.5505  -46.6333         28.4  143.6
16         Brazylia  Rio de Janeiro   -22.9068  -43.1729         30.1    7.7
17         Brazylia        Brasilia   -15.8267  -47.9218         26.7    5.3
18            Indie          Mumbai    19.0760   72.8777         29.0  128.0

In [50]:
all[(all["Temperatura"] > 20) & (all["Państwo"] == "USA")]

  Państwo       Miasto  Szerokość   Długość  Temperatura  Opad
1     USA  Los Angeles    34.0522 -118.2437         38.3   2.3